<?

/* includes/uploadNcheck.php errors */
$error_msg[101]="הקובץ שניסית להעלות תופס יותר מהגודל המותר להעלאה, נא להקטין את הקובץ או לשלוח קובץ מתאים יותר";
$error_msg[102]="סוג הקובץ שניסית להעלות אינו מסוג קובץ תמונה";
$error_msg[103]="נכשל בהעברת הקובץ בתור השרת, לפרטים נוספים נא לפנות לאחראי האתר";

/* add/game.php errors */
$error_msg[201]="חסר שם המשחק";
$error_msg[202]="חסר תיאור המשחק";
$error_msg[203]="חסרה תמונת המשחק";
$error_msg[204]="חסר אתר המשחק";
$error_msg[205]="חסרה קטגורית המשחק";
$error_msg[206]="על שם המשחק להיות מחרוזת בעלת 4 עד 15 תווים";
$error_msg[207]="שם הקובץ אינו תקני";

/* add/user.php errors */
$error_msg[301]="לא הכנסת כינוי";
$error_msg[302]="לא הכנסת סיסמא";
$error_msg[303]="לא הכנסת סיסמא שנייה";
$error_msg[304]="הסיסמאות אינן תואמות";
$error_msg[305]="לא הכנסת כתובת דואל";
$error_msg[306]="בחרת תוכנת מסרים מידיים אך לא הכנסת את הזיהוי<br>או שבחרת תוכנת מסרים והכנסת זיהוי לא תקני";
$error_msg[307]="כתובת האימייל שהכנסת אינה תקנית";
$error_msg[308]="הכינוי שהכנסת אינו תקני<br> על הכינוי להכיל בין 4 ל15 תווים <br>בין התווים המותרים - אותיות עבריות, אותיות לועזיות, מספרים והסימן \"_\" ";
$error_msg[309]="הסיסמא שהכנת אינה תקנית <br> אורך הסיסמא צריך להיות בין 6 ל12 תווים והתווים שהיא יכולה להכיל הם אותיות ומספרים";
$error_msg[310]="הכינוי כבר תפוס, נא להשתמש בכינוי אחר";
$error_msg[311]="כתובת הדואל נרשמה כבר<br> אם ההרשמה לא בוצעה על ידך אז הכתובת תשתחרר תוך שעה משעת ההרשמה";
/* sql errors and messages */
$error_msg[401]="";
?>